# -*- coding: utf-8 -*-
"""
@author: Manvel Arutiunov
"""

Trains = {
        '001А':['”Красная стрела”', 'СПб - Москва'],
        '013У':['”Южный Урал”', 'Челябинск - Москва'],
        '059Г':['”Волга”', 'Нижний Новгород - Москва'],
        '059Е':['”Тюмень”', 'Нижневартовск - Москва'],
        '025В':['”Воронеж”', 'Воронеж - Москва']
}

num = input ('Веедите номер поезда: ')

if num in Trains:
        print('Поезд:', num, Trains[num][0], 'следует по маршруту:', Trains[num][1])
else:
        for item in Trains:
                print('Поезд:', item, Trains[item][0], 'следует по маршруту: ', Trains[item][1])
        print('Пожалуйства выберите Ваш номер поезда из списка:')
        
