# -*- coding: utf-8 -*-
"""
@author: Manvel Arutiunov
"""

Trains = {
'001А':['”Красная стрела”', 'СПб - Москва', '07:55'],
'013У':['”Южный Урал”', 'Челябинск - Москва', '06:22'],
'059Г':['”Волга”', 'Нижний Новгород - Москва', '00:29'],
'059Е':['”Тюмень”', 'Нижневартовск - Москва', '09:30'],
'025В':['”Воронеж”', 'Воронеж - Москва', '07:50']}

while True:
        num = input ('Введите номер поезда: ')

        if num in Trains:
                print('\nПоезд:', num, Trains[num][0], 'следует по маршруту:', Trains[num][1], '\nПрибывает в Москву в', Trains[num][2])
                break
        else:
                for item in Trains:
                        print('\nПоезд:', item, Trains[item][1])
                print('\nПожалуйства выберите Ваш номер поезда из списка:')
                continue
        
